{
    "about": {
        "name": "Kyle Nahrgang",
        "title": "Software Technologist",
        "location": "Collegeville, PA",
        "about": "I am a seasoned software technologist with extensive experience in designing, implementing, and documenting architectural solutions that require cross-team collaboration. My career includes a strong focus on technical engineering, where I have developed a passion for creating robust software solutions. I have a proven track record of building highly functional teams that deliver complex features, backed by a deep understanding of embedded software design and a commitment to engineering excellence.",
        "email": "career@kyle.nahrgang.dev",
        "phone": "610.304.0538",
        "links": [
            {
                "type": "github",
                "url": "https://github.com/kylenahrgang"
            },
            {
                "type": "linkedin",
                "url": "https://www.linkedin.com/in/kyle-nahrgang/"
            },
            {
                "type": "website",
                "url": "https://nahrgang.dev/"
            }
        ]
    },
    "sections": [
        {
            "type" : "chips",
            "title" : "Skills",
            "data" : [
                "Agile",
                "API Development",
                "Automation",
                "Bash",
                "BLE",
                "Buildroot",
                "C",
                "C++",
                "C#",
                "Docker",
                "Dynatrace",
                "Embedded Systems",
                "Git",
                "Java",
                "Jenkins",
                "JIRA",
                "Linux",
                "LucidChart",
                "Mac OSX",
                "Machine Learning",
                "MongoDB",
                "NoSQL",
                "Object-oriented Programming",
                "Python",
                "ReactJS",
                "REST",
                "Rust",
                "Software Architecture",
                "SpringBoot",
                "Splunk",
                "SQL",
                "Test Driven Development",
                "ULE",
                "Unit Tests",
                "Virtualization",
                "Websockets",
                "Windows",
                "Z-Wave"
            ]
        },
        {
            "type" : "info-grid",
            "title" : "Projects",
            "data" : [
                {
                    "title": "FULL-STACK BILLIARD LEAGUE HANDICAP PREDICTION APP",
                    "bullets": [
                        "React Frontend",
                        "Rust / Actix-web REST API",
                        "Auth0 JWT authentication",
                        "MongoDB (Atlas) backed database",
                        "Reverse-engineered GraphQL API to scrape league data",
                        "Docker container running nginx hosted by GCP cloud-run instance",
                        "Custom machine learning models for handicap prediction using Rust (burn)"
                    ],
                    "tags": [
                        "React",
                        "Rust",
                        "REST API",
                        "MongoDB",
                        "GraphQL",
                        "GCP",
                        "Auth0"
                    ],
                    "url": "https://apa.nahrgang.dev"
                },
                {
                    "title": "REACT RESUME TEMPLATE",
                    "bullets": [
                        "Joy-UI Components",
                        "Driven by JSON Data"
                    ],
                    "tags": [
                        "React",
                        "Joy-UI"
                    ],
                    "url": "https://github.com/kyle-nahrgang/resume"
                }
            ]
        },
        {
            "type": "experience",
            "title": "Experience",
            "data": [
                {
                    "name": "XYPRO",
                    "location": "Simi Valley, CA",
                    "remote": true,
                    "titles": [
                        {
                            "role": "Senior Software Engineer",
                            "start": "Oct 2024",
                            "responsibility": [
                                "Spent 100% of time using C to implement bug fixes and improvements to SQLXpress, an interface for the SQL subsystem on HPE NonStop",
                                "Improved Makefile build system",
                                "Created custom VS-Code extension using TypeScript to remotely debug C/C++ applications on HPE NonStop host",
                                "Developed proof-of-concept conversion of legacy Makefile build system to modern CMake implementation",
                                "Identified and recommended 5 changes to modernize legacy codebase"
                            ]
                        }
                    ]
                },
                {
                    "name": "ADT",
                    "location": "Blue Bell, PA",
                    "remote": true,
                    "tags": [
                        "Software Architecture", "C++", "GCP", "Secure Boot", "Home Automation"
                    ],
                    "titles": [
                        {
                            "role": "Principal Software Engineer",
                            "start": "May 2020",
                            "end": "Oct 2024",
                            "responsibility": [
                                "Spent 10 months as one of two software architects for product engineering organization of 200 engineers designing several facets of ADT’s “Trusted Neighbor” feature set reporting to the Director of Product Architecture",
                                "As a software architect, spent 50% of time converting requirements into holistic architectural solutions that spanned from C++ edge device firmware, through Java SpringBoot and GCP hosted backend, and to mobile and web UIs",
                                "As a software architect, spent 25% of time communicating solutions to cross functional teams consisting of all levels of engineer, from junior developers to the VP of Engineering",
                                "As a software architect, spent 25% of time working with C-suite to find and present solutions to high-visibility issues and feature requests",
                                "Implemented processes to streamline architectural intake, solution review, and output",
                                "Spent 3 years as Lead Engineer for Firmware Development team of 10 engineers reporting to the Director of Firmware Engineering developing embedded C++ business logic deployed to tens of thousands of Base devices",
                                "As Lead Engineer, I spent 30% of time writing and reviewing modern C++ and Rust",
                                "As Lead Engineer, I spent 30% of time mentoring more junior developers and fostering strong engineering principles",
                                "As Lead Engineer, I spent 40% of time establishing priorities and coordinating development efforts across between firmware, backend, and UI development teams",
                                "Oversaw full product lifecycle of ADT’s Base device including writing the first lines of C++ business logic code through first article inspection for mass manufacturing at the manufacturing facility in Vietnam",
                                "Re-wrote legacy business logic application using modern C++ techniques (C++17) resulting in a 60% reduction in lines of code and 95% unit test code coverage",
                                "Oversaw development of and integration with wireless devices and sensors using ULE and Z-Wave radios",
                                "Ensured that the security system business logic conformed to security industry standards, primarily SIA PC-01",
                                "Acted as primary maintainer of ARM based embedded linux distribution generated using Buildroot",
                                "Established a culture of engineering excellence that focused on rigor and best practice to deliver high reliable code where under 5% of bug reports were regressions",
                                "Implemented and maintained GCP build pipelines that generated and deployed build artifacts to tens of thousands of Base devices",
                                "Established automated pipelines to ensure all unit tests passed, code coverage exceeded 95%, and that code was formatted and documented before any code could be merged",
                                "Designed and implemented encrypted firmware upgrade system",
                                "Supported production issues leveraging custom logging in Dynatrace and Splunk",
                                "Implemented Secure Boot",
                                "Developed embedded encryption tools for ARM using OP-TEE",
                                "Built a firmware recovery platform using Python Django",
                                "Participated in third-party penetration testing which found no vulnerabilities",
                                "Debug and modify Linux kernel drivers for I2S audio, WiFi, and others",
                                "Developed proof-of-concept board support package (BSP) for ARM based device using Yocto",
                                "Consistently awarded highest performance ratings"
                            ]
                        }
                    ]
                },
                {
                    "name": "CardConnect / FirstData / Fiserv",
                    "location": "King of Prussia, PA",
                    "titles": [
                        {
                            "role": "Staff Software Engineer",
                            "start": "Jan 2017",
                            "end": "May 2020",
                            "responsibility": [
                                "Led a team of 3 senior-level engineers developing embedded application for credit card terminals to meet industry standards (EMV, ISO-8583, PCI-DSS)",
                                "Acted as lead developer for embedded payment application installed on over 100k credit card terminals",
                                "Spent 50% of time working with stakeholders to interpret requirements and schedule development",
                                "Spent 50% of time writing C++ (C++11) to resolve bugs and implement new features",
                                "Organized and led the rewrite of a legacy C/C++ payment application to use modern C++ techniques resulting in a 70% reduction in lines of code",
                                "Interfaced with customers to interpret feature requests into technical requirements",
                                "Acted as subject matter expert for EMV and ISO-8583 domain knowledge",
                                "Fully automated device and application certification testing, including building a Python based UI and an OpenBuilds based robot driven by a Java Spring Boot application which resulting in $30k/mo savings",
                                "Established rules and best practices for development, test, and deployment processes",
                                "Implemented and maintained build and deployment pipelines using Jenkins, GoCD, and BitBucket",
                                "Attended industry conferences and reported on changing standards",
                                "Consistently awarded highest performance ratings"
                            ]
                        }
                    ]
                },
                {
                    "name": "Unisys",
                    "location": "Malvern, PA",
                    "titles": [
                        {
                            "role": "Senior Software Engineer",
                            "start": "Sept 2007",
                            "end": "Jan 2017",
                            "responsibility": [
                                "Led development team of 5 to 10 engineers writing network monitoring applications for linux and windows to assist in Unisys Stealth ","configuration utility",
                                "As team lead, I spent 50% of my time writing C/C++ and 50% managing requirements and delivery schedules",
                                "Acted as Scrum Master for team of 5 to 10 engineers in development team of 15 teams and 140 engineers working on the Unisys s-Par Hypervisor",
                                "As Scrum Master, I spent 80% of my time writing code to deliver features, and 20% of my time communicating priorities and planning delivery ","schedules",
                                "Developed high-speed interconnect between hypervisor instances using Infiniband",
                                "Developed virtual network (vNIC) device drivers for Linux and Windows to communicate between virtual machines running on Unisys s-Par",
                                "Maintained Buildroot build system which generated several Linux images that comprised the Unisys s-Par hypervisor",
                                "Acted as subject matter expert for Command subsystem of Unisys s-Par, written in C#",
                                "Wrote C to contribute to the Control subsystem of Unisys s-Par",
                                "Promoted from Associate Software Engineer to Senior Software Engineer within 3 years",
                                "Consistently awarded highest performance ratings"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "type" : "info-grid",
            "title" : "Patents",
            "data": [
                {
                    "title": "Establishing trust between applications in a computing environment",
                    "subtitle": "Application US17/885,236",
                    "description": "A method, system and device are disclosed. A premises device comprising a first operating system and a second operating system is described. The premises device comprises processing circuitry configured to establish a chain of trust at least between the first operating system and at least one software application associated with the second operating system. The processing circuitry is further configured to perform at least one action based at least in part on the established chain of trust.",
                    "tags": [
                        "ADT", "Pending", "Aug 2022"
                    ],
                    "url": "https://patents.google.com/patent/US20230049508A1"
                },
                {
                    "title": "Network provisioning and tokenization using a remote terminal",
                    "subtitle": "US-12047356",
                    "description": "A method of tokenizing sensitive data from a terminal device includes receiving, a connection request comprising a hardware serial number associated with a terminal device and validating the hardware serial number associated with the terminal device. The method includes sending a command to a terminal device that causes the terminal device to display a prompt for sensitive data associated with a user interacting with the terminal device and receiving an encrypted data packet from the terminal device. The encrypted data packet includes the sensitive data. The method includes sending the encrypted data packet to a gateway system for tokenization, receiving a token that represents the sensitive data, and providing the token to the terminal device.",
                    "tags": [
                        "FirstData", "Nov 2021"
                    ],
                    "url": "https://patents.google.com/patent/US12047356B2"
                },
                {
                    "title": "Nonstop Computing Fabric Arrangements",
                    "subtitle": "US-10965616",
                    "description": "Systems and methods for non-stop computing in a virtualization fabric are disclosed. One system includes a computing fabric comprising a plurality of host platforms, the plurality of host platforms including at least a first host platform and a second host platform communicatively connected to the first host platform. The system also includes an interconnect service partitions residing on the first host platform. The system includes a plurality of guest partitions distributed across the plurality of host platforms. The system further includes a DNS server instance managed by at least one of the plurality of interconnect service partitions and defining at least one zone, the at least one zone including one or more partitions from among the plurality of guest partitions distributed across the plurality of host plat forms.",
                    "tags": [
                        "Unisys", "March 2021"
                    ],
                    "url": "https://patents.google.com/patent/US10965616B2"
                },
                {
                    "title": "System and method of constructing a memory-based interconnect between multiple partitions",
                    "subtitle":  "Application US13/955,188",
                    "bullets": [

                    ],
                    "description": "The shared memory interconnect system provides an improved method for efficiently and dynamically sharing resources between two or more guest partitions. The system also provides a method to amend the parameters of the shared resources without resetting all guest partitions. In various embodiments, a XML file is used to dynamically define the parameters of shared resources. In one such embodiment using a XML or equivalent file, the interconnect system driver will establish a mailbox shared by each guest partition. The mailbox provides messaging queues and related structures between the guest partitions. In various embodiments, the interconnect system driver may use macros to locate each memory structure. The shared memory interconnect system allows a virtualization system to establish the parameters of shared resources during runtime.",
                    "tags": [
                       "Unisys", "Abandoned", "March 2013"
                    ],
                    "url": "https://patents.google.com/patent/US20140143372A1"
                }
            ]
        },
        {
            "type" : "education",
            "title" : "Education",
            "data": [
                {
                    "name": "Drexel University",
                    "location": "Philadelphia, PA",
                    "degree": "B.S. Computer Engineering",
                    "start": "Sep 2006",
                    "end": "Jun 2011"
                }
            ]
        }
    ]
}
